Slybald/Musopti/embedded/firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c6"

# Musopti: hardware-first defaults for the real board
# CONFIG_MUSOPTI_IMU_SIMULATED is not set
# CONFIG_MUSOPTI_AUDIO_SIMULATED is not set
# CONFIG_MUSOPTI_DISPLAY_SIMULATED is not set

# BLE (NimBLE)
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# Log level
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
